       FD ARQ-IMPVND.
       01 IMPVND-REGISTRO.
          05 IMPVND-CODVND              PIC 9(03).
          05 IMPVND-CPF                 PIC 9(11).
          05 IMPVND-NOME                PIC X(40).
          05 IMPVND-LATITUDE            PIC S9(03)V9(08).
          05 IMPVND-LONGITUDE           PIC S9(03)V9(08).
      



      


