       FD ARQ-IMPCLI.
       01 IMPCLI-REGISTRO.
          05 IMPCLI-CODCLI              PIC 9(07).
          05 IMPCLI-CNPJ                PIC 9(14).
          05 IMPCLI-RAZAOSOCIAL         PIC X(40).
          05 IMPCLI-LATITUDE            PIC S9(03)V9(08).
          05 IMPCLI-LONGITUDE           PIC S9(03)V9(08).
      


