       FD ARQ-CLIENTE.
       01 CLI-REGISTRO.
         05 CLI-CODIGO           pic 9(007)         value  zeros.       
         05 CLI-CNPJ             pic 9(014) 		values zeros.       
		 05 CLI-RAZAOSOCIAL      pic X(040) 		values spaces.      
		 05 CLI-LATITUDE         pic s9(003)v9(008) values zeros.       
		 05 CLI-LONGITUDE        pic s9(003)v9(008) values zeros.
         05 CLI-CODVND           PIC 9(003)         value  zeros.


