       FD ARQ-VENDEDOR.
       01 VND-REGISTRO.
         05 VND-CODIGO           pic 9(003)         value  zeros.       
         05 VND-CPF              pic 9(011) 		values zeros.       
		 05 VND-NOME             pic X(040) 		values spaces.      
		 05 VND-LATITUDE         pic s9(003)v9(008) values zeros.       
		 05 VND-LONGITUDE        pic s9(003)v9(008) values zeros.       

      


