       01 WL-LINK-GERAR-REL-CLI.
          05 WL-NMARQUIVO                  PIC X(22).
          05 WL-PRM-ORD                    PIC X(01).
          05 WL-PRM-CLA                    PIC X(01).
          05 WL-PRM-CDCLI                  PIC 9(07).
          05 WL-PRM-RAZAO                  PIC X(40).
          05 WL-PRM-CDVND                  PIC 9(03).
          05 WL-FLAG-RETORNO               PIC 9(01).
          05 WL-MSG-RETORNO                PIC X(40).
      


