	     select ARQ-VENDEDOR assign to disk wid-arq-vendedor
         organization       is indexed
         access mode        is dynamic
         record key         is VND-CODIGO
         lock mode          is manual
         file status        is WS-RST-ACESS-VND.
      


