       SELECT ARQ-IMPVND           ASSIGN TO DISK WID-ARQ-IMPVND        
              ORGANIZATION         IS LINE SEQUENTIAL
              ACCESS MODE          IS SEQUENTIAL
              LOCK MODE            IS MANUAL 
              FILE STATUS          IS WS-RST-ACESS-IMPVND.


      


