       SELECT ARQ-IMPCLI           ASSIGN TO DISK WID-ARQ-IMPCLI        
              ORGANIZATION         IS LINE SEQUENTIAL
              ACCESS MODE          IS SEQUENTIAL
              LOCK MODE            IS MANUAL 
              FILE STATUS          IS WS-RST-ACESS-IMPCLI.  
      


