	     select ARQ-CLIENTE assign to disk wid-arq-cliente
         organization       is indexed
         access mode        is dynamic
         record key         is CLI-CODIGO
         lock mode          is manual
         file status        is WS-RESULTADO-ACESSO.
      


